
import { Skill } from './types';

export const SKILLS_DATA: Skill[] = [
  {
    id: 1,
    title: "فهم الذات",
    description: "ما مدى معرفتك بنفسك، وفهمك لذاتك، وتحديدك لقدراتك ومهاراتك، وإدارتك لحياتك، وتعاملك مع مشاعرك. ضع تقييما لكل معيار من ۱۰ درجات ( صفر - أبدا ، 10 - دائما )",
    questions: [
      "أخصص باستمرار وقتا كافيا للتفكير في حياتي وخططي وأهدافي",
      "أستطيع أن أكتب الآن أهم اهتمامات في حياتي",
      "أستطيع أن أكتب الآن أهم ١٠ قيم هي الأهم عندي",
      "أعرف أهم 10 نقاط قوة لدي",
      "أعرف أهم 10 نقاط ضعف لدي",
      "أعرف أهم 5 مهارات أتقنها",
      "أعرف الأمور التي أستطيع تغييرها في نفسي والتي لا أستطيع تغييرها",
      "أعرف ماذا يزعجني وماذا يريحني في تصرفات الآخرين",
      "إذا أخطأت أعترف بأخطائي ولا أبحث عن مبررات أو لوم للآخرين من السهل علي أن أعتذر",
      "أتعلم من أخطائي ، وأستفيد من ملاحظات الآخرين لتطوير نفسي",
    ]
  },
  {
    id: 2,
    title: "فهم القيادة",
    description: "ما مدى فهمك لعلم القيادة والصفات القيادية، وقواعد ومبادئ القيادة، والفرق بين القيادة والإدارة، والقوانين الحاكمة للقيادة، وغيرها من عناصر القيادة؟ ضع تقييما لكل معيار من ۱۰ درجات ( صفر - أبدا ، ١٠ - دائما )",
    questions: [
        "أستطيع أن أعطي تعريفا دقيقا وواضحا للقيادة",
        "أستطيع أن أكتب الآن ٥ فروق بين القيادة والإدارة",
        "أستطيع أن أعطي ٦ أدوار رئيسية للقائد",
        "أستطيع أن أكتب الآن ٥ قوانين رئيسية للقيادة",
        "أعرف 5 علامات لاكتشاف القادة",
        "أعرف أهم ٥ صفات للقائد النموذجي",
        "أعرف أهم 5 أدوات لتحريك الناس نحو الهدف",
        "أعرف أهم ١٠ علوم تنمي العمق القيادي",
        "أعرف على الأقل 3 فروق بين الرجل والمرأة في القيادة",
        "لدي خطة واضحة لزيادة عمقي في فهم القيادة",
    ]
  },
  {
    id: 3,
    title: "التفكير الفعال",
    description: "ما مدى عمق التفكير لديك؟ وهل لديك منهجيات للتفكير والتحليل واتخاذ القرارات والمواقف؟ وما مدى المرونة الفكرية والإبداعية عندك؟ ضع تقييما لكل معيار من ۱۰ درجات ( صفر - أبدا ، 10 - دائما )",
    questions: [
      "أفكر باستمرار في ( أفكاري وآرائي ) ومدى صحتها",
      "أحب القراءة في كتب ( الفكر أو الفلسفة أو المنطق ) لأنها تجعلني أفكر بطرق جديدة ومنهجية",
      "لدي مرونة عالية لتغيير قناعاتي وأفكاري ، وتبني آراء جديدة",
      "العادات والتقاليد لا تحكم طريقة تفكيري ( وإن كنت أراعيها اجتماعيا )",
      "أستمتع بتجربة الأمور الجديدة ( ما لم تكن حراما ) وأحب تطبيق طرق جديدة لإدارة العمل",
      "أستطيع الربط بين الأمور غير المرتبطة سابقا (مثال : تطبيقات علمية بحتة في إدارة الأعمال)",
      "يقول الناس عني أني مفكر مبدع وأقدم حلولا غير تقليدية",
      "أفهم ما يجري حولي وفق الصورة الشاملة وليس الأحداث المتفرقة",
      "لدي وعي وفهم واضح للبيئة التي أعمل فيها ( سياسيا ، اجتماعيا ، اقتصاديا ، تقنيا)",
      "أحلل الأمور والقضايا وفق منهجية واضحة دون أحكام مسبقة مثل نظرية المؤامرة)",
    ]
  },
  {
    id: 4,
    title: "الرؤية المرشدة",
    description: "هناك إجماع بين علماء القيادة على أن مهارة تشكيل الرؤية المرشدة هي من أهم المهارات القيادية. ونقصد بالرؤية ( أي الصورة المحددة للمستقبل المنشود )، ونقصد بالمرشدة ( أي التي تحكم وتوجه جميع قراراتك واختياراتك ). ضع تقييما لكل معيار من ۱۰ درجات ( صفر - أبدا ، ١٠ - دائما )",
    questions: [
      "أستطيع أن أصف ما سأكون عليه بعد ٢٠ سنة من الآن",
      "أستطيع أن أكتب أهم 5 أهداف لحياتي",
      "أستطيع أن أكتب ٧ أهداف سأحققها خلال 5 سنوات",
      "أستطيع أن أكتب الآن ١٠ أهداف سأحققها خلال ۱۲ شهرا",
      "جميع أهدافي قد صفتها بمعايير قابلة للقياس",
      "أعرف بوضوح وبمعايير واضحة متى أقبل أو أرفض أي منصب أو مهمة أو مشروع يعرض علي",
      "لدي مجال رئيسي واحد أركز عليه",
      "أخصص لمجال حياتي ٥٠% من وقتي وعلاقاتي وقراءاتي ومشاريعي وإنجازاتي",
      "أعيد النظر في خطتي بشكل سريع كل ٦ شهور",
      "أعيد كتابة خطتي بالكامل كل 5 سنوات",
    ]
  },
  {
    id: 5,
    title: "تحليل المعلومات",
    description: "هل أنت متابع جيد لما يجري حولك؟ وهل تستطيع التفريق بين الآراء والحقائق والمعلومات الهامة وغيرها؟ وهل لديك منهجية واضحة في جمع المعلومات وتحليلها؟ ضع تقييما لكل معيار من ۱۰ درجات ( صفر - أبدا ، ١٠ - دائما )",
    questions: [
      "أتابع الأخبار العالمية باستمرار، وأعرف ما يجري في العالم بشكل جيد",
      "أتابع الأخبار المحلية باستمرار، وأعرف ما يجري في البلد بشكل جيد",
      "أستطيع التفريق بوضوح بين الحقائق والمعلومات من جهة والآراء والأفكار من جهة أخرى",
      "أتخذ رأيا مبدئيا وليس نهائيا ( عندما لا تكون المعلومات كافية )",
      "أستشير ذوي الآراء المختلفة وليس ذوي الاتجاه الواحد)",
      "عندما لا تكون الأمور واضحة، والمعلومات غير كافية، أستطيع أن أتوقع الاتجاه العام لسير الأمور",
      "أجمع معلوماتي من مصادر متنوعة، ولا أستقي من منبع واحد أو جهات محدودة",
      "لدي فضول كبير، فأسأل كثيرا ، وأحب أن أعرف ما يجري في الخفاء",
      "أعرف كيف أربط بين المعلومات المتناثرة لأصل إلى استنتاجات محددة",
      "أركز على المعلومات الهامة وأستطيع تمييزها من بين المعلومات الكثيرة",
    ]
  },
  {
    id: 6,
    title: "تحليل الشخصيات",
    description: "القائد الفعال يعرف الناس ويستطيع تحليل شخصياتهم، وبالتالي يعرف كيف يتعامل مع كل نمط من الشخصيات، وما الذي يحركه ويحفزه، وهذا هو لب القيادة القدرة على تحريك الناس نحو الهدف). ضع تقييما لكل معيار من ١٠ درجات ( صفر - أبدا ، 10 - دائما )",
    questions: [
      "أتقن طريقة علمية واحدة على الأقل لتحليل الشخصيات",
      "أستطيع التمييز بين المغرور والواثق بنفسه",
      "أستطيع التمييز بين الشخص المرح ومهزوز الشخصية",
      "أستطيع التمييز بين القيادي والمفكر",
      "أستطيع التمييز بين الذكي والمبدع",
      "أستطيع التمييز بين من يصلح للقيادة ممن يصلح للتنفيذ",
      "أستطيع التمييز بين الفعال في العلاقات من الفعال في الإنجازات",
      "أعرف من يكون فعالا عندما يعمل في فريق ممن فعاليته لا تظهر إلا عندما يعمل وحده",
      "أستطيع التمييز بين القيادي فعلا ممن لديه صفات موهمة بالقيادة",
      "أعرف كيف أتعامل بشكل مختلف مع كل من الشخصيات المذكورة أعلاه",
    ]
  },
  {
    id: 7,
    title: "تحليل المواقف",
    description: "القائد الفعال لديه مهارة خاصة في تحليل المواقف. والموقف يتضمن الظروف العامة وأهمها الأوضاع السياسية والاقتصادية والاجتماعية ومستوى التقنية، كما يتضمن الظروف الخاصة بالموقف وأهمها طبيعة المهمة المطلوبة، ومستوى حماس وكفاءة الشخص المنفذ. ضع تقييما لكل معيار من ۱۰ درجات ( صفر - أبدا ، ١٠ - دائما )",
    questions: [
      "أعرف نظرية القيادة الموقفية، وأتقن تطبيقها",
      "أعرف الأوضاع السياسية العالمية والمحلية",
      "أعرف الأوضاع الاقتصادية العالمية والمحلية",
      "أعرف الأوضاع الاجتماعية العالمية والمحلية",
      "أتابع تطورات التقنية العالمية الجماهيرية وليست المختصة) ومستواها في بلدي كذلك",
      "أستطيع تحديد مستوى حماس أي شخص أكلفه تجاه المهمة التي أطلبها منه",
      "أستطيع تحديد درجة كفاءة أي شخص أكلفه تجاه المهمة التي أطلبها منه",
      "عندي علامات أعرف منها متى أحول أي شخص من مهمة إلى أخرى",
      "لدي تمييز أعرف من خلاله متى أركز على تدريب شخص معين، ومتى لا ينفع معه التدريب",
      "لدي علامات واضحة أعرف منها متى أتوقف عن المحاولة لتطوير شخص معين وأقرر فصله والاستغناء عنه",
    ]
  },
  {
    id: 8,
    title: "منهجية اتخاذ القرارات",
    description: "هل لديك منهجية واضحة لاتخاذ القرارات وتنفيذها وفق خطوات متسلسلة)؟ وهل تعرف كيف تميز بين القرارات الهامة وغيرها؟ وهل تستطيع أن تحلل الآثار القريبة والبعيدة لكل قرار؟ ضع تقييما لكل معيار من ۱۰ درجات ( صفر - أبدا ، ١٠ - دائما )",
    questions: [
      "أعرف ما هي المعلومات اللازمة التي أحتاجها لاتخاذ القرار، وأستطيع تمييزها من بين المعلومات الكثيرة",
      "أستطيع تمييز القرارات الهامة وأحرص على المشاركة فيها مبكرا ( ولا يهمني المشاركة في كل القرارات حيث أن بعضها لا أهمية له )",
      "لدي منهجية وخطوات واضحة لاتخاذ القرارات",
      "أستطيع أن أحدد من أشاور في كل حالة فلا أشاور نفس الأشخاص في كل القضايا )",
      "أتخذ القرارات بعد أن يكون لدي بدائل كثيرة ( خمسة على الأقل) وليس بديلان أو ثلاثة",
      "أستطيع أن أحدد الآثار المستقبلية بعيدة المدى للقرارات والتصرفات",
      "أستطيع تقديم حلول إبداعية وطرق مبتكرة لصنع القرارات",
      "يمكنني اتخاذ قرارات صائبة حتى في أجواء الغموض وعدم اكتمال المعلومات",
      "أعرف متى أؤجل القرار ( دون أن يكون ذلك ترددا)",
      "أعرف كيف أحول القرارات إلى التنفيذ، ومعظم قراراتي يتم تنفيذها (فوق ٨٠%)",
    ]
  },
  {
    id: 9,
    title: "إدارة التغيير",
    description: "أهم الأهداف القيادية هي إدارة عملية التغيير في المنظمات والأشخاص وعدم الاكتفاء بالوضع القائم)، بهدف الوصول إلى مستويات أعلى في الأداء والفاعلية. والتغيير علم متميز يحتوي داخله علوم التخطيط والتحليل والإبداع والمقاومة. ضع تقييما لكل معيار من ۱۰ درجات ( صفر - أبدا ، ١٠ - دائما )",
    questions: [
      "أعرف المعادلة العامة للتغيير ( والفروق بين التغيير والتخطيط)",
      "أعرف أهم 3 عوامل ترفع من احتمال نجاح التغيير",
      "أعرف أهم ٦ أسباب تجعل الناس تقاوم التغيير",
      "أعرف أهم 10 طرق يستعملها المعارضون للتغيير لمقاومة التغيير",
      "أخطط لاستعمال الطرق الفعالة لمقاومة المقاومة",
      "أُميز الفروق بين التغيير طويل المدى وقصير المدى",
      "أستطيع التحديد بوضوح متى أستعمل التغيير السريع مقابل التغيير المتدرج",
      "لدي قواعد واضحة للحزم أو استعمال المرونة",
      "أُميز بين الحالات التي يجب فيها مراعاة المشاعر وبين غيرها",
      "لدي علامات واضحة أقرر بها متى أنسحب من عملية التغيير وأقر بفشلها",
    ]
  },
  {
    id: 10,
    title: "الاتصال الفعال",
    description: "ما مدى فهمك لعلم الاتصال؟ وما مدى تمكنك من تطبيقه؟ وهل تحسن استعمال طرق التحفيز وتنمية الولاء؟ باختصار: هل أنت فعال في تحريك الآخرين؟ ( هذا هو صلب القيادة ). ضع تقييما لكل معيار من ۱۰ درجات ( صفر - أبدا ، ١٠ - دائما )",
    questions: [
      "أعرف العناصر الخمسة الرئيسية التي تشكل عملية الاتصال وتجعله فعالا",
      "أختار (الرسالة) التي أوصلها للآخرين بعناية وأنوعها حسب الموقف والجهة المستقبلة",
      "أستعمل أدوات متنوعة في إيصال رسالتي (شفاهة، كتابة، تدريب، مشاهدة ... وغيرها) ولا أكتفي بأداة واحدة",
      "أعمل على تبسيط (الرسالة) وإزالة أية تعقيدات قد تجعل فهمها صعبا",
      "أتأكد أن الذي يستقبل رسالتي قد وصلته (الرسالة) وفهمها قبل أن أطلب منه تنفيذها",
      "أفهم أهمية البيئة أو المناخ الذي تحدث فيه عملية الاتصال وأعمل على تصفيته من أي تشويش حقيقي أو عاطفي",
      "أحفز الآخرين لإبداء آرائهم والتعبير عن أفكارهم ومشاعرهم",
      "أستعمل أساليب منوعة في تحفيز من يعملون معي ماديا ومعنويا",
      "لدي خطة واضحة بأدوات محددة لتنمية ولاء من حولي تجاه المنظمة وأهدافها",
      "لدي منهجية واضحة لكيفية استعمال أدوات تحريك الناس ( الترغيب، الترهيب، الإلقاء، الإقناع، القدوة)",
    ]
  },
  {
    id: 11,
    title: "فن التمكين",
    description: "التفويض هو تحديد الهدف وترك طريقة تنفيذه للمنفذ، وأما التمكين فهو أعلى من ذلك حيث يقوم المسؤول بإفهام من حوله الأهداف العامة للمنظمة، ويترك لهم حرية التصرف وتحديد الأولويات والأهداف المحددة طرق التنفيذ دون الرجوع إليه. ضع تقييمًا لكل معيار من 10 درجات (صفر - أبدًا ، 10 - دائمًا)",
    questions: [
        "أعرف قدرات كل شخص أقوده، وبالتالي أعرف المهام التي يصلح لها، ويمكن تفويضه فيها",
        "كل من يعمل معي يعرف خطتنا العامة (أين كنا، إلى أين وصلنا، إلى أين سنذهب)",
        "كل من يعمل معي يعرف دوره في الخطة ومكانه فيها",
        "لدي ثقة عالية في الناس مما يجعل عملية التفويض والتمكين سهلة لدي",
        "لا أعاقب من يحاول ويخطئ، بل أعاقب من لا يحاول أصلاً، أو من يكرر نفس الخطأ رغم تعليمي له",
        "أعطي صلاحيات واسعة لكل من يثبت عندي كفاءته وأمانته، ولا أتدخل في عمله التفصيلي، وأكتفي بالأمور المؤثرة فقط",
        "أمارس القيادة (التخطيط، الإبداع، العلاقات الرئيسية، التدريب والتحفيز، وحل المشاكل المزمنة)، وأترك الإدارة لمن أثق بهم",
        "أعمل على تطوير من حولي، وأساعدهم لوضع خططهم الشخصية وتحديد المناصب المستقبلية المناسبة لهم",
        "أستطيع تمييز من يمكنني تفويضه ممن يمكنني تمكينه (ارجع للشرح في أعلى الصفحة)",
        "لدي تقسيم واضح للمتابعة أحدد بناء عليه من يحتاج إلى المتابعة اليومية أو الأسبوعية ممن لا يحتاجها",
    ]
  },
  {
    id: 12,
    title: "الاستمرارية والثبات",
    description: "القائد الفعال لديه قدرة عالية تساعده على الثبات على خطته وأهدافه، وتساهم في إصراره عليها، ولديه محفز داخلي عالي يجعله لا يتأثر بالتثبيط والإحباط، كما أن لديه درجة عالية من الصبر فلا يترك أي عمل معلقا بل يكمله حتى النهاية. ضع تقييمًا لكل معيار من 10 درجات (صفر - أبدًا ، 10 - دائمًا)",
    questions: [
        "لدي محفز داخلي كبير نحو الأهداف والقضايا التي أتبناها، حيث أشجع نفسي بنفسي",
        "تشجيع الآخرين لي جميل، ولكنه ليس ضروريًا، حيث سأستمر نحو أهدافي بالتشجيع أو بدونه",
        "التثبيط والهجوم والنقد من قبل الآخرين قد يؤثر في نفسي قليلاً، ولكنه لا يصرفني عن أهدافي أو يجعلني أتوقف",
        "أحرص على أن أتابع أي عمل بدأ به، وأجعله يتقدم باستمرار، ولو قليلاً قليلاً، والمهم ألا يتوقف",
        "إذا فشلت في عمل أو مهمة، فأتوقف لتأمل الدروس والمعاني التي تعلمتها ثم أبدأ بسرعة في مشروع آخر",
        "أعمل في عدة مشاريع في نفس الوقت، وأنوعها بحيث يكون بعضها كبير وبعضها سهلا",
        "إذا واجهتني مشكلة أو مهمة واتضح لي أنها بحاجة إلى مهارات خاصة ليست عندي، فأقوم بتعلمها، أو استعين بمن يتقنها",
        "عندما أحاول العمل في أي مهمة أو مشروع بطريقة معينة وأفشل، أحاول مرة أخرى لكن بطريقة جديدة ولا أكرر الطريقة السابقة",
        "لدي نظام واضح لمتابعة أعمالي وإنجازاتي، وكذلك لمن يعملون معي",
        "إذا وصلت في أي مشروع إلى طريق مسدود، أعرف متى أنسحب تمامًا ومتى أحاول بطريقة أخرى",
    ]
  }
];
